cangalaya/control-aforo-esp8266/src/main.cpp
/* ------------- CONTROL DE AFORO - 2 PUERTAS COMUNICADAS -----------------
 *  Desarrollado por: Ing. Alonso Cangalaya (cangalaya.2007@gmail.com)
 *  Funciones:
 *    - Realiza conteo ABCD (sensores S1 y S2 conectados a este ESP8266)
 *    - Comunicación WiFi con protocolo UDP -> este dispositivo es el MAIN GATE
 *    - Comunicación con el Arduino Nano para mostrar datos en el display
 *    - Comunicación con el Dashboard (LabView) por protocolo UDP
 */

///////////// DEPENDENCIAS ///////////
#include <TimeLib.h>
#include <ESP8266WiFi.h>
#include <WiFiUdp.h> // Protocolo UDP (transferencia de datos rapida, pero no segura)
//#include <DMDESP.h>               // librería para el display
#include <Separador.h>           // liberia para separa string (se usa para separar valores en la trama de datos de comunicación con el UDP)
#include <Firebase_ESP_Client.h> //#include <Firebase_ESP_Client.h>
#include <EEPROM.h>              // update de memorias fash
#include <EEPROM.h>
//#include <fonts/SystemFont5x7.h>  //liberias para la tipología de fuente a mostrar en pantalla
//#include <fonts/Droid_Sans_12.h>
//#include <fonts/Arial_Black_16.h>
//#include <fonts/Arial14.h>

//--------- Fuentes para el Display ------------------

// const uint8_t *FONT1 = Arial14;
// const uint8_t *FONT2 = Arial_Black_16;
// const uint8_t *FONT3 = SystemFont5x7;
// const uint8_t *FONT4 = Droid_Sans_12;
// const uint8_t *FONT = FONT2;

///// VARIABLES PARA EL RESET DE AFORO ////
int minuto = 0;
int minuto_anterior = 0;
int counter_minutos_inactividad = 0;

//----------------------------------------DMD Configuration (P10 Panel)
//#define DISPLAYS_WIDE 3 //--> Panel Columns         <<<<<<<<<<<<<<< D I S P L A Y   C O L U M N A S <<<<<<<<<<<
//#define DISPLAYS_HIGH 1 //--> Panel Rows
// DMDESP Disp(DISPLAYS_WIDE, DISPLAYS_HIGH);          //Creación de Instancia llamada Disp -> Number of Panels P10 used (Column, Row)
//----------------------------------------
Separador s; // instancia para separar string
//----------------------------------------
// Define Firebase Data object
FirebaseData fbdo;

FirebaseAuth auth;
FirebaseConfig config;

// creación de JSON
FirebaseJson jsonConfigWifi;
FirebaseJson jsonConfigUdp;
FirebaseJson jsonConfigTarjet;
FirebaseJson jsonData;



#include "config.h" // Configurar datos de la red
#include "UDP.hpp"
#include "ESP8266_Utils.hpp"
#include "ESP8266_Utils_UDP.hpp"

//////////// variables FIREBASE   ////////////////

// Provide the token generation process info.
#include <addons/TokenHelper.h>

// Provide the RTDB payload printing info and other helper functions.
#include <addons/RTDBHelper.h>

/* 2. Define the API Key */
#define API_KEY "AIzaSyACwNdd8nTeRCLSr6tFyZLQ-jquw8ljKa8"

/* 3. Define the RTDB URL */
#define DATABASE_URL "prueba-2-e4543-default-rtdb.firebaseio.com" //<databaseName>.firebaseio.com or <databaseName>.<region>.firebasedatabase.app

/* 3. Define the project ID */
#define FIREBASE_PROJECT_ID "prueba-2-e4543"

/* 4. Define the user Email and password that alreadey registerd or added in your project */
#define USER_EMAIL "comedor1@tasa-callao.com"
#define USER_PASSWORD "comedor1"




void jsonConfigDataSet()
{

  // SETEO DE CONFIGURACIÓN DE TARJET
  jsonConfigTarjet.add("abcd", "medium");
  jsonConfigTarjet.add("aforo", random(1, 10));
  jsonConfigTarjet.add("count-delay-milisegundos", random(1, 10));
  jsonConfigTarjet.add("estado", "on");
  jsonConfigTarjet.add("inactivity-hours-reset", 3);
  jsonConfigTarjet.add("set-data-realtime-segundos", 30);

  // SETEO DE CONFIGURACIÓN WIFI
  jsonConfigWifi.add("hostname", "bano-varones");
  jsonConfigWifi.add("ssid", "WF_P2_2");
  jsonConfigWifi.add("password", "R420437015R");

  // SETEO DE CONFIGURACIÓN UDP
  jsonConfigUdp.add("master-port", 8890);
  jsonConfigUdp.add("second-port", 8891);
  jsonConfigUdp.add("datalogger-ip", 20);
  jsonConfigUdp.add("datalogger-port", 8888);

  // SETEO DE CONFIGURACIÓN DATA - REALTIME
  jsonData.add("egresos", random(1, 10));
  jsonData.add("excesos", random(1, 10));
  jsonData.add("ingresos", random(1, 10));
  jsonData.add("total", random(1, 10));

  if (Firebase.RTDB.setJSONAsync(&fbdo, "/tasa/callao/bano-varones/config/wifi", &jsonConfigWifi))
  {
    Serial.println("Datos WIFI Firebase Realtime establecidos !!");
  }
  else
  {
    Serial.println("*** Datos WIFI no establecidos en Firebase");
  }

  if (Firebase.RTDB.setJSONAsync(&fbdo, "/tasa/callao/bano-varones/config/tarjet", &jsonConfigTarjet))
  {
    Serial.println("Datos TARJET Firebase Realtime establecidos !!");
  }
  else
  {
    Serial.println("*** Datos TARJET no establecidos en Firebase");
  }

  if (Firebase.RTDB.setJSONAsync(&fbdo, "/tasa/callao/bano-varones/config/udp", &jsonConfigUdp))
  {
    Serial.println("Datos UDP Firebase Realtime establecidos !!");
  }
  else
  {
    Serial.println("*** Datos UDP no establecidos en Firebase");
  }

  Serial.printf("Set jsonData... %s\n", Firebase.RTDB.setJSONAsync(&fbdo, "/tasa/callao/bano-varones/data", &jsonData) ? "ok" : fbdo.errorReason().c_str());
}

//////////// variables para reseteo por inactividad /////////////
unsigned long time_millis = 0;
unsigned long before_time_millis = 0;
unsigned long counter_millis = 0;

//========== variables para la subrutina - censusPeople() ===========

byte Sensor_1 = LOW;
byte Sensor_2 = LOW;
#define Sensor_1 4
#define Sensor_2 5
#define PtoBuzzer 2 /////////<<<<<<<<< SALIDA -> BUZZER

int cambio_pantalla = 0;

int inicialiado = 0;

int Sensor1_Time = 0;
int Sensor2_Time = 0;
int Same_Time = 0;

int Last_Sensor1_Time = 0;
int Last_Sensor2_Time = 0;
int Last_Same_Time = 0;

int Sensor1_Min_Time = 1;  // SISTEMA ANTI - RUIDO PARA
int Sensor2_Min_Time = 1;  // SISTEMA ANTI - RUIDO PARA
int Sametime_Min_Time = 0; // KOMATSU ANTI - RUIDO PARA

int delaymonitoreo = 0;

// int cont=0;

String A = "X";
String B = "X";
String C = "X";
String D = "X";

//=================================================================================================================================================
//============================================================== R U T I N E S ====================================================================
//=================================================================================================================================================
// Subrutina para el sensado de personas al salir o entrar || incluye filtro ABDC  || Modifica los valores de BDatos
unsigned int cont = 0;
char inicio = 0;
unsigned int contador_now = 0;

void censusPeople()
{
  cont++;
  // while (a=="a"){     //COMO PRUEBA PUESTO PARA ACELERAR LA LECTURA
  if (inicialiado == 0)
  {
    // total=0;
    // last_value = 0;
    cambio_pantalla = 1;
    inicialiado = 1;
  }

