cangalaya/control-aforo-esp8266/src/main.cpp
  ////////////////////////////////////////////////////////////
  // TIEMPO (NO EXACTO ES SOLO UN CONTADOR) PARA EL LOW DEL SENSOR_1
  if (digitalRead(Sensor_1) == LOW)
  {
    Sensor1_Time++;
    // Serial.println("Sensor1_Time = "+ String(Sensor1_Time));
    if (Sensor1_Time != 0)
    {
      Last_Sensor1_Time = Sensor1_Time;
      // Serial.println(Last_Sensor1_Time);
    }
  }
  else
  {
    Sensor1_Time = 0;
  }

  // TIEMPO (NO EXACTO ES SOLO UN CONTADOR) PARA EL LOW DEL SENSOR_2
  if (digitalRead(Sensor_2) == LOW)
  {
    Sensor2_Time++;
    // Serial.println("Sensor2_Time = "+ String(Sensor2_Time));
    if (Sensor2_Time != 0)
    {
      Last_Sensor2_Time = Sensor2_Time;
      // Serial.println(Last_Sensor2_Time);
    }
  }
  else
  {
    Sensor2_Time = 0;
  }

  // TIEMPO (NO EXACTO ES SOLO UN CONTADOR) PARA EL LOW DEL SENSOR_2
  if (digitalRead(Sensor_1) == LOW && digitalRead(Sensor_2) == LOW)
  {
    Same_Time++;
    // Serial.println("Same_Time  = "+ String(Same_Time));
    if (Same_Time != 0)
    {
      Last_Same_Time = Same_Time;
      // Serial.println(Last_Same_Time);
    }
  }
  else
  {
    Same_Time = 0;
  }

  // Imp_Conteo_Tiempo_Real();
  // mpresion_ABCD();
  // Solo_Cont();

  // A - A - A - A - A - A - A - A - A - A - A - A - A - A - A - A - A - A -
  // A - A - A - A - A - A - A - A - A - A - A - A - A - A - A - A - A - A -
  // ASIGNANDO "A" SENSOR 1
  if (digitalRead(Sensor_1) == LOW && A == "X")
  {
    A = "1E";
  }
  // ASIGNANDO "A" SENSOR 2
  if (digitalRead(Sensor_2) == LOW && A == "X")
  {
    A = "2E";
  }

  // LIBERANDO "A" SENSOR 1
  if (digitalRead(Sensor_1) == HIGH && A == "1E" && B == "X" && C == "X" && D == "X")
  {
    A = "X";
  }

  // LIBERANDO "A" SENSOR 2
  if (digitalRead(Sensor_2) == HIGH && A == "2E" && B == "X" && C == "X" && D == "X")
  {
    A = "X";
  }
  // B - B - B - B - B - B - B - B - B - B - B - B - B - B - B - B - B - B -
  // B - B - B - B - B - B - B - B - B - B - B - B - B - B - B - B - B - B -
  // ASIGNANDO "B" SENSOR 1
  if (digitalRead(Sensor_1) == LOW && A == "2E")
  {
    B = "1E";
  }
  // ASIGNANDO "B" SENSOR 2
  if (digitalRead(Sensor_2) == LOW && A == "1E")
  {
    B = "2E";
  }

  // LIBERANDO "B" SENSOR 1
  if (digitalRead(Sensor_1) == HIGH && A == "2E" && B == "1E" && C == "X" && D == "X")
  {
    B = "X";
  }

  // LIBERANDO "B" SENSOR 2
  if (digitalRead(Sensor_2) == HIGH && A == "1E" && B == "2E" && C == "X" && D == "X")
  {
    B = "X";
  }
  // C - C - C - C - C - C - C - C - C - C - C - C - C - C - C - C - C - C -
  // C - C - C - C - C - C - C - C - C - C - C - C - C - C - C - C - C - C -
  // ASIGNANDO "C" SENSOR 1
  if (digitalRead(Sensor_1) == HIGH && A == "1E" && B == "2E")
  {
    C = "1S";
  }
  // ASIGNANDO "C" SENSOR 2
  if (digitalRead(Sensor_2) == HIGH && A == "2E" && B == "1E")
  {
    C = "2S";
  }

  // LIBERANDO "C" SENSOR 1
  if (digitalRead(Sensor_1) == LOW && A == "1E" && B == "2E" && C == "1S" && D == "X")
  {
    C = "X";
  }

  // LIBERANDO "C" SENSOR 2
  if (digitalRead(Sensor_2) == LOW && A == "2E" && B == "1E" && C == "2S" && D == "X")
  {
    C = "X";
  }

  // D - D - D - D - D - D - D - D - D - D - D - D - D - D - D - D - D - D -
  // D - D - D - D - D - D - D - D - D - D - D - D - D - D - D - D - D - D -

  // ASIGNANDO "D" SENSOR 1
  if (digitalRead(Sensor_1) == HIGH && A == "2E" && B == "1E" && C == "2S")
  {
    D = "1S";
  }
  // ASIGNANDO "D" SENSOR 2
  if (digitalRead(Sensor_2) == HIGH && A == "1E" && B == "2E" && C == "1S")
  {
    D = "2S";
  }

  if (digitalRead(Sensor_2) == HIGH && A == "1E" && B == "2E" && C == "1S")
  { // && B == "2E" C == "1S" && D == "2S"

    // FILTRO POR TIEMPO DE PULSO (TIEMPO SENSOR 1, TIEMPO SENSOR 2, AL MISMO TIEMPO
    if (Last_Sensor1_Time >= Sensor1_Min_Time && Last_Sensor2_Time >= Sensor2_Min_Time && Last_Same_Time >= Sametime_Min_Time)
    {

      // Serial.println ("ENTRÓ");

      // Serial.println ("PERSONA ENTRANDO");
      // Realiza la acción deseada

      // cli(); //Deshabilitar interrupciones
      ingreso++;
      total++;
      cambio_pantalla = 1;
    }
    else
    {
      Serial.println("CONTEO DE ENTRADA POR RUIDO, NO VÁLIDO");

      // Imp_Conteo_Ultimos_Tiempos();
    }

    A = "X";
    B = "X";
    C = "X";
    D = "X";
  }

  if (digitalRead(Sensor_1) == HIGH && A == "2E" && B == "1E" && C == "2S")
  { //&& B == "1E" && C == "2S" && D == "1S"

    // FILTRO POR TIEMPO DE PULSO (TIEMPO SENSOR 1, TIEMPO SENSOR 2, AL MISMO TIEMPO
    if (Last_Sensor1_Time >= Sensor1_Min_Time && Last_Sensor2_Time >= Sensor2_Min_Time && Last_Same_Time >= Sametime_Min_Time)
    {

      // Serial.println ("SALIÓ");

      // Serial.println ("PERSONA SALIENDO");
      // cli(); //Deshabilitar interrupciones
      egreso++;
      total--;
      cambio_pantalla = 1;

      // if (total < 0)
      //    {
      //     total = 0;
      //     egreso--;
      //    }
    }
    else
    {
      Serial.println("CONTEO DE SALIDA POR RUIDO, NO VÁLIDO");

      // IMPRESION DE ULTIMO TIEMPO REGISTRADO
      // Imp_Conteo_Ultimos_Tiempos();
    }

    A = "X";
    B = "X";
    C = "X";
    D = "X";
  }

  if (last_value != total)
  {
    if (last_value < total)
    {
      // si la persona entro
      //     {
      Serial.print("entro | "); // entro
      BDatos.total++;           // seteamos los valores locales
      BDatos.ingresos++;
      Serial.println("Aforo: " + String(BDatos.aforo) + "  Total: " + String(BDatos.total)); // entro
      // SendUDP_Packet(String() + BDatos.estado_inicial + '|' + BDatos.aforo + '|' + BDatos.total + '|' + BDatos.ingresos + '|' + BDatos.egresos);    // el elemento separador es el |
      flag_send_data = 1; // enviamos la data actualizada
      // actualizar_pantalla();                                                                    // actualizamos pantalla con nuevos valores
      counter_minutos_inactividad = 0; // reset a minutos de inactividad
      counter_millis = 0;              // reseteamos el counter_millis para anular el reseteo por inacctividad
    }
    else
    {
      Serial.print("salio | ");  // salio
      if (BDatos.total - 1 >= 0) // protección para que no adopte valores negativos
      {
        BDatos.total--;
        BDatos.egresos++;
        // SendUDP_Packet(String() + BDatos.estado_inicial + '|' + BDatos.aforo + '|' + BDatos.total + '|' + BDatos.ingresos + '|' + BDatos.egresos);
        flag_send_data = 1; // enviamos la data actualizada
        // actualizar_pantalla();
        counter_minutos_inactividad = 0;                                                     // reset a minutos de inactividad
        counter_millis = 0;                                                                  // reseteamos el counter_millis para anular el reseteo por inacctividad
      }                                                                                      // actualizamos pantalla con nuevos valores
      Serial.println("Aforo: " + String(BDatos.aforo) + "  Total: " + String(BDatos.total)); // entro
    }
    last_value = total;
    cambio_pantalla = 1;
  }

  if (cambio_pantalla == 1 && digitalRead(Sensor_1) == HIGH && digitalRead(Sensor_2) == HIGH)
  {
    // Pantalla();
    cambio_pantalla = 0;

    // IMPRESION DE ULTIMO TIEMPO REGISTRADO
    // Imp_Conteo_Ultimos_Tiempos();
  }
}

