cangalaya/control-aforo-esp8266/src/main.cpp
//===============================================================================================================================================
//===============================================================================================================================================
// CLOCK ROUTINES

// NTP Servers:
static const char ntpServerName[] = "south-america.pool.ntp.org";

const int timeZone = -5; // Perú

const int NTP_PACKET_SIZE = 48; // NTP time is in the first 48 bytes of message
// byte packetBuffer[NTP_PACKET_SIZE]; //buffer to hold incoming & outgoing packets

time_t getNtpTime();
void sendNTPpacket(IPAddress &address);

// REINICIO DE CUENTA
// void reinicio_de_cuenta(){
//   if (hour() == hora_reinicio && minute()==minuto_reinicio && second() ==0 ){
//     Serial.print("Reinicio de Cuenta ------ día nuevo\n");
//     BDatos.total=0;
//     BDatos.ingresos=0;
//     BDatos.egresos=0;
//   }
//   minuto_anterior = minuto;
//   minuto = minute();
//   if (minuto_anterior != minuto){
//     counter_minutos_inactividad++;
//   }
//   if (counter_minutos_inactividad > minutos_inactividad_max){
//     Serial.print("Reinicio de Cuenta ----- por minutos de inactividad\n");
//     counter_minutos_inactividad = 0;
//     BDatos.total=0;
//     BDatos.ingresos=0;
//     BDatos.egresos=0;
//   }

// }

time_t getNtpTime()
{
  IPAddress ntpServerIP; // NTP server's ip address

  while (UDP.parsePacket() > 0)
    ; // discard any previously received packets
  Serial.println("Transmit NTP Request");
  // get a random server from the pool
  WiFi.hostByName(ntpServerName, ntpServerIP);
  Serial.print(ntpServerName);
  Serial.print(": ");
  Serial.println(ntpServerIP);
  sendNTPpacket(ntpServerIP);
  uint32_t beginWait = millis();
  while (millis() - beginWait < 1500)
  {
    int size = UDP.parsePacket();
    if (size >= NTP_PACKET_SIZE)
    {
      Serial.println("Receive NTP Response");
      UDP.read(packetBuffer, NTP_PACKET_SIZE); // read packet into the buffer
      unsigned long secsSince1900;
      // convert four bytes starting at location 40 to a long integer
      secsSince1900 = (unsigned long)packetBuffer[40] << 24;
      secsSince1900 |= (unsigned long)packetBuffer[41] << 16;
      secsSince1900 |= (unsigned long)packetBuffer[42] << 8;
      secsSince1900 |= (unsigned long)packetBuffer[43];
      return secsSince1900 - 2208988800UL + timeZone * SECS_PER_HOUR;
    }
  }
  Serial.println("No NTP Response :-(");
  return 0; // return 0 if unable to get the time
}

// send an NTP request to the time server at the given address
void sendNTPpacket(IPAddress &address)
{
  // set all bytes in the buffer to 0
  memset(packetBuffer, 0, NTP_PACKET_SIZE);
  // Initialize values needed to form NTP request
  // (see URL above for details on the packets)
  packetBuffer[0] = 0b11100011; // LI, Version, Mode
  packetBuffer[1] = 0;          // Stratum, or type of clock
  packetBuffer[2] = 6;          // Polling Interval
  packetBuffer[3] = 0xEC;       // Peer Clock Precision
  // 8 bytes of zero for Root Delay & Root Dispersion
  packetBuffer[12] = 49;
  packetBuffer[13] = 0x4E;
  packetBuffer[14] = 49;
  packetBuffer[15] = 52;
  // all NTP fields have been given values, now
  // you can send a packet requesting a timestamp:
  UDP.beginPacket(address, 123); // NTP requests are to port 123
  UDP.write(packetBuffer, NTP_PACKET_SIZE);
  UDP.endPacket();
}

//===============================================================================================================================================
//===============================================================================================================================================

void setup()
{
  Serial.begin(9600);
  //----------------------------------------DMDESP Display Setup
  // Disp.start(); //--> Run the DMDESP library
  // Disp.setBrightness(250); //--> Brightness level
  // Disp.setFont(FONT); //--> Determine the font used
  //----------------------------------------
  pinMode(PtoBuzzer, OUTPUT); // BUZZER
  delay(2);
  digitalWrite(PtoBuzzer, LOW);
  //-------------------------------------- SENSORES
  pinMode(Sensor_1, INPUT); // sets the digital pin as Input
  // attachInterrupt(digitalPinToInterrupt(Sensor_1), in_people, RISING);

  pinMode(Sensor_2, INPUT); // sets the digital pin as Input
  // attachInterrupt(digitalPinToInterrupt(Sensor_2), out_people, RISING);
  //-------------- WIFI UDP -----------------

  ConnectWiFi_STA();
  ConnectUDP();

  //--------------- CLOCK NTP SERVER ----------------
  setSyncProvider(getNtpTime);
  setSyncInterval(300);

  // -------------- FIREBASE -------------------------
  Serial.printf("Firebase Client v%s\n\n", FIREBASE_CLIENT_VERSION);

  /* Assign the api key (required) */
  config.api_key = API_KEY;

  /* Assign the user sign in credentials */
  auth.user.email = USER_EMAIL;
  auth.user.password = USER_PASSWORD;

  /* Assign the RTDB URL (required) */
  config.database_url = DATABASE_URL;

  /* Assign the callback function for the long running token generation task */
  config.token_status_callback = tokenStatusCallback; // see addons/TokenHelper.h

  // Or use legacy authenticate method
  // config.database_url = DATABASE_URL;
  // config.signer.tokens.legacy_token = "<database secret>";

  Firebase.begin(&config, &auth);

  // Comment or pass false value when WiFi reconnection will control by your code or third party library
  Firebase.reconnectWiFi(true);

  // Optional, use classic HTTP GET and POST requests.
  // This option allows get and delete functions (PUT and DELETE HTTP requests) works for
  // device connected behind the Firewall that allows only GET and POST requests.
  Firebase.RTDB.enableClassicRequest(&fbdo, true);

  jsonConfigDataSet();
  setCofigEprom ();
}

int inicio_r = 0;
unsigned int refresh = 0; // variable para enviar datos cada 2 segundos, sistema de defensa frente a perdida de datos udp
time_t prevDisplay = 0;   // when the digital clock was displayed
unsigned long int PrevMillis = 0;

void loop()
{
  GetUDP_Packet(false); // esperar a que llegen paquetes

  time_millis = millis();
  if (time_millis < 500)
  {                         // cuando millis desborde despues de 50d aprox.
    before_time_millis = 0; // volvemos el tiempo_aux a 0;
  }

